app/controllers/interests_controller.rb

INSERT INTO `interests` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('ad', '2010-04-24 07:57:08', '2010-04-24 07:57:08', 0, 'ad')
---
  def create
    @interest = Interest.new(params[:interest])

    respond_to do |format|
      if @interest.save