app/controllers/users_controller.rb

  def show
    @user = User.find_by_username(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'dummy') LIMIT 1